#!/usr/bin/env python3
# Author: Armit
# Create Time: 2024/06/26 

# 短链纠缠，十字星形
# {38: [[32, 25], [33, 27], [44, 49], [45, 51]]}

import math

phi_list = [
  0.0,
  0.3141592653589793,
  0.6283185307179586,
  0.9424777960769379,
  1.2566370614359172,
  1.5707963267948966,
  1.8849555921538759,
  2.199114857512855,
  2.5132741228718345,
  2.827433388230814,
  3.141592653589793,
  3.455751918948772,
  3.7699111843077517,
  4.084070449666731,  # <- doing now
  4.39822971502571,
  4.71238898038469,
  5.026548245743669,
  5.340707511102648,
  5.654866776461628,
  5.969026041820607,
]
phi = phi_list[13]
if phi > 3.142:
  phi -= math.pi*2

CIRCUIT = [
  # GHZ
  'H Q38',
  'H Q32', 'CZ Q38 Q32', 'H Q32',
  'H Q25', 'CZ Q32 Q25', 'H Q25',
  'H Q33', 'CZ Q38 Q33', 'H Q33',
  'H Q27', 'CZ Q33 Q27', 'H Q27',
  'H Q44', 'CZ Q38 Q44', 'H Q44',
  'H Q49', 'CZ Q44 Q49', 'H Q49',
  'H Q45', 'CZ Q38 Q45', 'H Q45',
  'H Q51', 'CZ Q45 Q51', 'H Q51',
  # phase-shift
  f'RZ Q38 {phi}',
  f'RZ Q32 {phi}',
  f'RZ Q25 {phi}',
  f'RZ Q33 {phi}',
  f'RZ Q27 {phi}',
  f'RZ Q44 {phi}',
  f'RZ Q49 {phi}',
  f'RZ Q45 {phi}',
  f'RZ Q51 {phi}',
  # GHZ.dagger
  'H Q51', 'CZ Q45 Q51', 'H Q51',
  'H Q45', 'CZ Q38 Q45', 'H Q45',
  'H Q49', 'CZ Q44 Q49', 'H Q49',
  'H Q44', 'CZ Q38 Q44', 'H Q44',
  'H Q27', 'CZ Q33 Q27', 'H Q27',
  'H Q33', 'CZ Q38 Q33', 'H Q33',
  'H Q25', 'CZ Q32 Q25', 'H Q25',
  'H Q32', 'CZ Q38 Q32', 'H Q32',
  'H Q38',
  # measure
  'M Q38',
  'M Q32', 'M Q25',
  'M Q33', 'M Q27',
  'M Q44', 'M Q49',
  'M Q45', 'M Q51',
]

qcis_code = '\n'.join(CIRCUIT)
print(qcis_code)
